itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
/*
 * Calcolo indice di bisogno idrico (0 - 100)
 * Logica: Calcola un bisogno base (Temp + Umidità) e lo riduce in base alla pioggia.
 */
int CalculateSmartScore(float t, float h, float p, int rain_prob) {
    //Normalizzazione degli input
    if (h < 0.0f) h = 0.0f;
    if (h > 100.0f) h = 100.0f;
    if (rain_prob < 0) rain_prob = 0;
    if (rain_prob > 100) rain_prob = 100;

    //Fattore Temperatura (0-100)
    // Sotto i 10 gradi il bisogno è 0. A 40 gradi il bisogno è massimo (100).
    float t_factor = 0.0f;
    if (t > 10.0f) {
        t_factor = (t - 10.0f) * (100.0f / 30.0f); // Mappa 10->0, 40->100
        if (t_factor > 100.0f) t_factor = 100.0f;
    }

    //Fattore Umidità (0-100)
    // Più è bassa l'umidità, più sale il bisogno.
    float h_factor = 100.0f - h;

    // Bisogno Base (Media pesata)
    // Diamo più peso alla temperatura (es. 65%) che all'umidità (35%).
    float base_need = (t_factor * 0.65f) + (h_factor * 0.35f);

    //Correzione Pioggia (Moltiplicatore)
    // Se rain_prob è 100%, il moltiplicatore è 0.0 -> bisogno azzerato.
    // Se rain_prob è 0%, il moltiplicatore è 1.0 -> bisogno inalterato.
    float rain_modifier = 1.0f - (rain_prob / 100.0f);

    // Calcolo parziale
    float final_score = base_need * rain_modifier;

    // Correzione Pressione (Opzionale e molto lieve)
    // Interviene solo se la probabilità di pioggia non è già estrema
    if (p > 0.0f) { // Controllo validità pressione
        if (p < 1000.0f) {
            final_score -= 5.0f; // Leggera riduzione per brutto tempo in arrivo
        } else if (p > 1020.0f) {
            final_score += 5.0f; // Leggero aumento per alta pressione stabile
        }
    }

    // Clamping finale
    if (final_score < 0.0f) final_score = 0.0f;
    if (final_score > 100.0f) final_score = 100.0f;

    return (int)final_score;
}

static WIFI_Status_t SendWebPage(void)
{
  uint16_t SentDataLength;
  WIFI_Status_t ret = WIFI_STATUS_OK;
  float H, T, P;
  uint32_t total_len, sent_len = 0;
  uint16_t chunk_len;

  // Lettura Sensori
  H = BSP_HSENSOR_ReadHumidity();
  T = BSP_TSENSOR_ReadTemp();
  P = BSP_PSENSOR_ReadPressure();

  // Recupero stato sistema
  int display_prob = (sim_mode_active) ? sim_rain_prob : real_rain_prob;

  // Legge fisicamente il pin per sapere se sta irrigando ORA
  int is_running = (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET);

  char *status_class;
  char *status_text;
  char *time_label;

  // Determina l'etichetta temporale (Oggi/Domani/Sim)
  if (sim_mode_active) time_label = "Simulazione";
  else time_label = (is_showing_tomorrow) ? "Domani" : "Oggi";

  // Logica Decisionale per il Banner (Testo e Colore)
  if (is_running) {
      //Se l'acqua scorre, sfondo VERDE e testo chiaro
      status_class = "bg-ok";
      status_text = "IRRIGAZIONE IN CORSO...";
  }
  else if (display_prob == -1 && !sim_mode_active) {
      status_class = "bg-wait";
      status_text = "ATTESA DATI METEO...";
  }
  else {
      // Se non irriga, mostriamo lo stato della pianificazione (Smart o Manuale)
      if (smart_mode_active) {
          if (last_calculated_score >= smart_threshold) {
              status_class = "bg-ok";
              status_text = "PIANIFICATA (Smart)";
          } else {
              status_class = "bg-stop"; // O bg-wait, a scelta
              status_text = "NON NECESSARIA (Score Basso)";
          }
      } else {
          // Modalità Manuale
          // Se display_prob > 60 (che sia oggi o domani), c'è rischio pioggia
          if (display_prob > 60) {
              status_class = "bg-stop";
              status_text = "SOSPESA (Previsione Pioggia)";
          } else {
              // Verifica se il giorno (oggi o domani) è abilitato
              int day_check = orario.weekday;
              // Se stiamo guardando a domani, controlliamo il giorno successivo nella maschera
              if (is_showing_tomorrow && !sim_mode_active) day_check = (day_check + 1) % 7;

              if (cfg_days_mask & (1 << day_check)) {
                  status_class = "bg-ok";
                  status_text = "PIANIFICATA";
              } else {
                  status_class = "bg-stop";
                  status_text = "DISABILITATA (Giorno OFF)";
              }
          }
      }
  }

  //INIZIO INVIO DATI (CHUNKS)

  // CHUNK 1: Header HTML statico
  total_len = strlen(HTML_HEADER);
  while (sent_len < total_len) {
      chunk_len = (total_len - sent_len > 500) ? 500 : (total_len - sent_len);
      memcpy(http, HTML_HEADER + sent_len, chunk_len);
      ret = WIFI_SendData(0, (uint8_t *)http, chunk_len, &SentDataLength, WIFI_WRITE_TIMEOUT);
      if(ret != WIFI_STATUS_OK) return ret;
      sent_len += chunk_len;
  }

  // CHUNK 2: Script Orologio
  sprintf((char *)http, "<script>startClock(%d,%d,%d);</script>", orario.hours, orario.minutes, orario.seconds);
  WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);

  // CHUNK 3: Status Bar e Dashboard Sensori
  char rainStr[20];
  if (display_prob == -1 && !sim_mode_active) sprintf(rainStr, "--");
  else sprintf(rainStr, "%d%%", display_prob);

  sprintf((char *)http,
    "<div class='status-bar %s'>"
      "<div style='display:flex; justify-content:space-between; align-items:center;'>"
         "<div><strong>Stato:</strong> %s</div>"
         "<div class='badge' style='background:rgba(0,0,0,0.2);'>%s</div>"
      "</div>"
      "<div class='v-center' style='font-size:0.9em; margin-top:5px;'>"
         "<span class='material-icons' style='font-size:1.1em; margin-right:5px'>cloud</span>"
         "Previsione Pioggia per&nbsp;<strong>%s</strong>:&nbsp;<strong>%s</strong>"
      "</div>"
    "</div>"
    "<div class='dashboard'>"
      "<div class='card'><span class='material-icons'>device_thermostat</span><span class='value'>%.1f</span><span class='unit'>&deg;C</span></div>"
      "<div class='card'><span class='material-icons'>water_drop</span><span class='value'>%.1f</span><span class='unit'>%%</span></div>"
      "<div class='card'><span class='material-icons'>compress</span><span class='value'>%.0f</span><span class='unit'>hPa</span></div>"
    "</div>",
    status_class,
    status_text,
    (sim_mode_active ? "SIMULAZIONE" : "ONLINE"),
    time_label, // Oggi o Domani
    rainStr,
    T, H, P
  );
  WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);

  // CHUNK 4: Pannello Pianificazione Manuale

    strcpy((char *)http, "<form method='POST'>");
    sprintf((char *)http + strlen((char *)http),
      "<div class='panel'>"
        "<h3><span class='material-icons'>schedule</span> Manuale</h3>"
        "<div class='form-row'>"
          "<div><label>Avvio (Ora)</label><input type='number' name='cfg_hour' value='%d' min='0' max='23'></div>"
          "<div><label>Durata (Min)</label><input type='number' name='cfg_dur' value='%d' min='1' max='60'></div>"
        "</div>"
        "<label>Giorni Attivi:</label>"
        "<div class='day-selector'>",
      cfg_start_hour, cfg_duration_min
    );
    WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);

    // Continuazione controllo Manuale (Checkbox Giorni)
    const char* days[] = {"L", "M", "M", "G", "V", "S", "D"};
    strcpy((char *)http, "");
    for(int i=0; i<7; i++) {
        sprintf((char *)http + strlen((char *)http),
          "<label><input type='checkbox' name='day_%d' value='1' %s>%s</label>",
          i, (cfg_days_mask & (1<<i)) ? "checked" : "", days[i]
        );
    }
    strcat((char *)http, "</div></div>");
    WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);


    // CHUNK 5: Pannello Auto Mode
    char *score_color = (last_calculated_score >= smart_threshold) ? "#27ae60" : "#7f8c8d";

    sprintf((char *)http,
        "<div class='panel' style='border-left: 5px solid #3498db;'>"
          "<h3><span class='material-icons'>psychology</span>Auto Mode</h3>"

          "<div class='toggle-wrap'>"
            "<input type='checkbox' name='smart_active' value='1' %s>"
            "<label><strong>ABILITA AUTO MODE</strong> (Ignora Giorni)</label>"
          "</div>"

