itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
                    currentTime->hours = h;
                    currentTime->minutes = m;
                    currentTime->seconds = s;
                    currentTime->weekday = GetWeekdayNum(wdayStr);

                    printf("\n>>> SUCCESSO HTTP: %02d:%02d:%02d (Giorno: %s) <<<\n",
                           currentTime->hours, currentTime->minutes, currentTime->seconds, wdayStr);

                } else {
                    printf("Errore nel parsing della data.\n");
                }
            } else {
                printf("Header 'Date:' non trovato nella risposta.\n");
            }

        } else {
            printf("Nessun dato ricevuto (Timeout o connessione chiusa).\n");
        }

        WIFI_CloseClientConnection(1);

    } else {
        printf("Errore apertura socket TCP 80.\n");
    }
}


void IncrementTime(void) {
    orario.seconds++;
    if (orario.seconds >= 60) {
        orario.seconds = 0; orario.minutes++;
        if (orario.minutes >= 60) {
            orario.minutes = 0; orario.hours++;
            if (orario.hours >= 24){
            	orario.hours = 0;

            	//cambio giorno
            	orario.weekday++;
            	if (orario.weekday > 6) orario.weekday = 0; // Dopo Domenica(6) torna Lunedì(0)
            }
        }
    }
}

void CheckWeatherForecast(void) {
    uint8_t ipAddr[4] = {0};
    uint8_t recvBuf[512];
    uint16_t receivedLen = 0, sentLen = 0;
    LOG(("\n--- METEO CHECK ---\n"));

    if (WIFI_GetHostAddress("api.open-meteo.com", ipAddr, 4) != WIFI_STATUS_OK) {
        LOG(("DNS Error API\n"));
        return;
    }

    if (WIFI_OpenClientConnection(1, WIFI_TCP_PROTOCOL, "api.open-meteo.com", ipAddr, 80, 0) == WIFI_STATUS_OK) {
        char request[512];


        sprintf(request, "GET /v1/forecast?latitude=%s&longitude=%s&daily=precipitation_probability_max&timezone=auto&forecast_days=2 HTTP/1.1\r\nHost: api.open-meteo.com\r\nConnection: close\r\n\r\n", LAT, LON);

        WIFI_SendData(1, (uint8_t*)request, strlen(request), &sentLen, 1000);

        if (WIFI_ReceiveData(1, recvBuf, 511, &receivedLen, 2000) == WIFI_STATUS_OK) {
            if (receivedLen > 0) {
                recvBuf[receivedLen] = 0;
                char *prob_start = strstr((char*) recvBuf, "precipitation_probability_max\":[");
                if (prob_start) {
                    char *ptr = strchr(prob_start, '[');
                    if (ptr) {
                        ptr++;
                        buf_rain_today = atoi(ptr); // Salva nel buffer OGGI

                        char *comma = strchr(ptr, ',');
                        if (comma) {
                            buf_rain_tomorrow = atoi(comma + 1); // Salva nel buffer DOMANI
                            LOG(("API Success: Buffer Oggi=%d%%, Domani=%d%%\n", buf_rain_today, buf_rain_tomorrow));
                        }
                    }
                }
            }
        }
        WIFI_CloseClientConnection(1);
    } else {
        LOG(("Connect Error API\n"));
    }
}

void SaveSettings(void) {
    FlashData_t dataToSave;

    // Copia variabili globali nella struct temporanea
    dataToSave.magic_number = CONFIG_MAGIC;
    dataToSave.saved_start_hour = cfg_start_hour;
    dataToSave.saved_duration_min = cfg_duration_min;
    dataToSave.saved_days_mask = cfg_days_mask;
    dataToSave.saved_smart_active = smart_mode_active;
    dataToSave.saved_smart_threshold = smart_threshold;
    dataToSave.saved_sim_mode = sim_mode_active;
    dataToSave.saved_sim_rain_prob = sim_rain_prob;

    //Scrittura in flash
    HAL_FLASH_Unlock();

    // Cancellazione pagina
    FLASH_EraseInitTypeDef EraseInitStruct;
    uint32_t PageError;
    EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
    EraseInitStruct.Banks       = FLASH_BANK_2;
    EraseInitStruct.Page        = 255;
    EraseInitStruct.NbPages     = 1;

    if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK) {
        printf("Errore Erase Flash!\n");
        HAL_FLASH_Lock();
        return;
    }

    // Scrittura dati
    uint64_t *data_ptr = (uint64_t*)&dataToSave;
    int iterations = (sizeof(FlashData_t) + 7) / 8; // Arrotonda a blocchi da 8 byte

    uint32_t address = FLASH_STORAGE_ADDR;
    for (int i = 0; i < iterations; i++) {
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, data_ptr[i]);
        address += 8;
    }

    HAL_FLASH_Lock();
    printf("Configurazione Salvata in Flash!\n");
}

void LoadSettings(void) {
    // Puntatore diretto alla memoria Flash
    FlashData_t *loadedData = (FlashData_t*)FLASH_STORAGE_ADDR;

    // Controllo se c'è il Magic Number
    if (loadedData->magic_number == CONFIG_MAGIC) {
        printf("Trovata configurazione salvata. Caricamento...\n");

        cfg_start_hour = loadedData->saved_start_hour;
        cfg_duration_min = loadedData->saved_duration_min;
        cfg_days_mask = loadedData->saved_days_mask;
        smart_mode_active = loadedData->saved_smart_active;
        smart_threshold = loadedData->saved_smart_threshold;
        sim_mode_active = loadedData->saved_sim_mode;
        sim_rain_prob = loadedData->saved_sim_rain_prob;

    } else {
        printf("Memoria vuota o corrotta. Uso valori di default.\n");
    }
}

void RTC_Init(void) {
    hrtc.Instance = RTC;
    hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
    hrtc.Init.AsynchPrediv = 127;
    hrtc.Init.SynchPrediv = 255;
    hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;

    // Abilita il clock per il power controller e l'accesso al dominio di backup
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();

    // Abilita il clock LSI (Low-Speed Internal, ~32kHz, che funziona in STOP mode)
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI;
    RCC_OscInitStruct.LSIState = RCC_LSI_ON;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    // Seleziona LSI come sorgente per l'RTC
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
    PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

