itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
    __HAL_RCC_RTC_ENABLE();
    HAL_RTC_Init(&hrtc);

    // Abilita l'interrupt per il WakeUp Timer dell'RTC
    HAL_NVIC_SetPriority(RTC_WKUP_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);
}

void Enter_LowPower_State(uint32_t sleep_duration_sec) {
    LOG(("\n[PWR] Inizio sequenza di spegnimento...\n"));

    //1. SPEGNIMENTO OUTPUT
    BSP_LED_Off(LED2);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET); // Sicurezza: spegne il relè

    //2. DISCONNESSIONE E SPEGNIMENTO WI-FI
    WIFI_StopServer(SOCKET);
    HAL_Delay(100);
    WIFI_Disconnect();
    HAL_Delay(100);

    //Hard Power-Off del chip Wi-Fi (forza il pin di Reset PE8 a LOW)
    __HAL_RCC_GPIOE_CLK_ENABLE();
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8, GPIO_PIN_RESET);

    //Disabilita l'interrupt del Wi-Fi
    HAL_NVIC_DisableIRQ(EXTI1_IRQn);

    // 3. IMPOSTAZIONE SVEGLIA RTC
    if (sleep_duration_sec > 60000) sleep_duration_sec = 60000;
    LOG(("[PWR] Risveglio programmato tra %ld secondi...\n", sleep_duration_sec));
    HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, sleep_duration_sec, RTC_WAKEUPCLOCK_CK_SPRE_16BITS);

    // 4. SOSPENSIONE SISTEMA (STOP MODE)
    HAL_SuspendTick(); // Ferma il battito di sistema
    HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
}

void Exit_LowPower_State(void) {
    // 1. RIPRISTINO CLOCK E BATTITO
    SystemClock_Config();
    HAL_ResumeTick();

    // 2. PULIZIA SVEGLIA RTC
    HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);

    LOG(("\n[PWR] >>> Risveglio! Riattivazione periferiche...\n"));

    // 3. RIATTIVAZIONE WI-FI E RICONNESSIONE
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
    HAL_Delay(100);

    // wifi_connect() richiama WIFI_Init(), che alzerà il pin PE8 riaccendendo il chip Wi-Fi
    while (wifi_connect() != 0) {
        LOG(("Tentativo di riconnessione fallito. Riprovo tra 2 secondi...\n"));
        HAL_Delay(2000);
    }

    // 4. SINCRONIZZAZIONE DATI (NTP e Meteo)
    UpdateTimeHTTP(&orario);
    CheckWeatherForecast();
    HAL_Delay(500);

    // 5. RIAPERTURA SERVER WEB
    if (WIFI_StartServer(SOCKET, WIFI_TCP_PROTOCOL, 1, "", PORT) == WIFI_STATUS_OK) {
        LOG(("[PWR] Server riaperto con successo. Sistema operativo.\n"));
    } else {
        LOG(("[PWR] ATTENZIONE: Errore riapertura Server.\n"));
    }

    // Aggiorniamo il timer di inattività per evitare che torni subito in STOP
    last_http_activity = HAL_GetTick();
}


void RTC_WKUP_IRQHandler(void) {
    // Pulisce i flag hardware di interrupt del WakeUp timer
    HAL_RTCEx_WakeUpTimerIRQHandler(&hrtc);
}

void EXTI15_10_IRQHandler(void) {
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_13);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
  // Interrupt dal Wi-Fi
  if (GPIO_Pin == GPIO_PIN_1) {
      SPI_WIFI_ISR();
  }
}

void SPI3_IRQHandler(void) {
  HAL_SPI_IRQHandler(&hspi);
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t* file, uint32_t line) {}
#endif

